In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
inputs = df.drop("salary_more_then_100k", axis="columns")
target = df["salary_more_then_100k"]
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder

C:\Users\ABC\anaconda3\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.3
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [10]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [11]:
inputs["company_n"] = le_company.fit_transform(inputs["company"])
inputs["jobs_n"] = le_jobs.fit_transform(inputs["job"])
inputs["degree_n"] = le_degree.fit_transform(inputs["degree"])

In [12]:
inputs.head()

  company                  job     degree  company_n  jobs_n  degree_n
0  google      sales executive  bachelors          2       2         0
1  google      sales executive    masters          2       2         1
2  google     business manager  bachelors          2       0         0
3  google     business manager    masters          2       0         1
4  google  computer programmer  bachelors          2       1         0

In [13]:
inputs = inputs.drop(["job", "degree", "company"], axis="columns")
inputs

    company_n  jobs_n  degree_n
0           2       2         0
1           2       2         1
2           2       0         0
3           2       0         1
4           2       1         0
5           2       1         1
6           0       2         1
7           0       1         0
8           0       0         0
9           0       0         1
10          1       2         0
11          1       2         1
12          1       0         0
13          1       0         1
14          1       1         0
15          1       1         1

In [14]:
from sklearn import tree

In [15]:
model = tree.DecisionTreeClassifier()

In [16]:
model.fit(inputs, target)

DecisionTreeClassifier()

In [18]:
model.score(inputs, target)

1.0

In [20]:
model.predict([[2,2,1]])

array([0], dtype=int64)

In [21]:
model.predict([[2,0,1]])

array([1], dtype=int64)

# Excersise

In [22]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df = df.drop(["PassengerId", "Name", "SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis="columns")
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [24]:
target = df.pop("Survived")
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [25]:
df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [28]:
le_sex = LabelEncoder()

In [29]:
df["int_sex"] = le_sex.fit_transform(df["Sex"])
df.head()

   Pclass     Sex   Age     Fare  int_sex
0       3    male  22.0   7.2500        1
1       1  female  38.0  71.2833        0
2       3  female  26.0   7.9250        0
3       1  female  35.0  53.1000        0
4       3    male  35.0   8.0500        1

In [30]:
df.pop("Sex")
df.head()

   Pclass   Age     Fare  int_sex
0       3  22.0   7.2500        1
1       1  38.0  71.2833        0
2       3  26.0   7.9250        0
3       1  35.0  53.1000        0
4       3  35.0   8.0500        1

In [35]:
null_values = pd.concat([df.isnull().sum()], axis=1, keys=["Data"])
null_values[null_values.sum(axis=1) > 0]

     Data
Age   177

In [38]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [39]:
null_values = pd.concat([df.isnull().sum()], axis=1, keys=["Data"])
null_values[null_values.sum(axis=1) > 0]

Empty DataFrame
Columns: [Data]
Index: []

In [42]:
model = tree.DecisionTreeClassifier()

In [44]:
from sklearn.model_selection import train_test_split

In [45]:
X_train, X_test, y_train, y_test = train_test_split(df, target, test_size=.2)

In [46]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [47]:
model.score(X_test, y_test)

0.8268156424581006